Revit 2027 API
RebarContainer.AppendItemFromRebar Method
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarContainerItem AppendItemFromRebar(
	Rebar rebar
)
Public Function AppendItemFromRebar (
	rebar As Rebar
) As RebarContainerItem
public:
RebarContainerItem^ AppendItemFromRebar(
	Rebar^ rebar
)
member AppendItemFromRebar :
        rebar : Rebar -> RebarContainerItem
Parameters
rebar Rebar
 The Rebar.
Return Value
RebarContainerItem
 The Rebar Container Item.
Exceptions
Exception | Condition
ArgumentException |  A RebarContainerItem cannot be created from a Free Form Rebar or from a Shape Driven Rebar whose Rebar Shape has End Treatments or Cranks or terminations' rotation angles are different than 0. -or- Can't create container from Rebar with moved bars. -or- Can't create container from Rebar with Custom Spacing layout.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace